/*Упражнение 4.4. Добавьте команды, 
с помощью которых можно было бы 
печатать верхний элемент стека 
(с сохранением его в стеке), 
дублировать его в стеке, менять 
местами два верхних элемента стека. 
Введите команду очистки стека.*/

double pfse(void) {
	
	if (sp > 0)
		return val[sp-1];
	else {
		printf("РѕС€РёР±РєР°: СЃС‚РµРє РїСѓСЃС‚\n");
		return 0.0;
	}

}

//Р”СѓР±Р»РёСЂРѕРІР°С‚СЊ СЌР»РµРјРµРЅС‚ РІ СЃС‚РµРєРµ
void duplStack(void) {

	if (sp < MAXVAL)
		val[sp++] = val[sp-1];
	else
		printf("РѕС€РёР±РєР°: СЃС‚РµРє РїРѕР»РѕРЅ, %g РЅРµ РґСѓР±Р»РёСЂСѓРµС‚СЃСЏ\n", val[sp]);
	}


//РњРµРЅСЏРµС‚ РјРµСЃС‚Р°РјРё 2-Р° РІРµСЂС…РЅРёС… СЌР»РµРјРµРЅС‚Р° СЃС‚РµРєР°
void change12(void) {
	double intermed;
	if (sp > 1) {
		intermed = val[sp - 1];
		val[sp - 1] = val[sp - 2];
		val[sp - 2] = intermed;
	}
	else printf("РѕС€РёР±РєР°: РІ СЃС‚РµРєРµ РѕРґРёРЅ СЌРµР»РµРјРµРЅС‚\n");

}

//РћС‡РёС‰Р°РµС‚ РІРµСЃСЊ СЃС‚РµРє
void clrStack() {

	if (sp > 0) 
		for (int i = sp; i <= 0; i--) 
			val[i] = NULL;

}
